local ShiZhuangList = {
    --KeyName  触发概率
    ["1阶灵甲"] = { { "自定义属性13" }, { 0 }, { "普攻5%几率提升20%攻速,持续4S" } },
    ["2阶灵甲"] = { { "自定义属性13" }, { 20 }, { "打怪经验加成+20%" } },
    ["3阶灵甲"] = { { "自定义属性13", "生命百分比" }, { 20, 10 }, { "人物最大血量+10%" } },
    ["4阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比" }, { 20, 10, 5, 5 }, { "人物攻击加成+5%" } },
    ["5阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比" }, { 20, 10, 5, 5 }, { "1%概率对怪物造成1%切割伤害" } }, ---1%概率切割怪物1%(切割伤害直接到上海流程完成,不使用动态属性)
    ["6阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8" }, { 20, 10, 5, 5, 5 }, { "5%概率触发鞭尸效果" } },
    ["7阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8" }, { 40, 10, 5, 5, 5 }, { "打怪经验加成+40%" } },
    ["8阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8", "自定义属性11" }, { 40, 10, 5, 5, 5, 5 }, { "回收加成+5%" } },
    ["9阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8", "自定义属性11" }, { 40, 10, 5, 5, 10, 5 }, { "10%概率触发鞭尸效果" } },
    ["10阶灵甲"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8", "自定义属性11" }, { 40, 10, 5, 5, 10, 5 }, { "2%概率切割怪物2%" } },

    ["5阶灵甲女"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比" }, { 20, 10, 5, 5 }, { "1%概率对怪物造成1%切割伤害" } }, ---1%概率切割怪物1%(切割伤害直接到上海流程完成,不使用动态属性)
    ["6阶灵甲女"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8" }, { 20, 10, 5, 5, 5 }, { "5%概率触发鞭尸效果" } },
    ["7阶灵甲女"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8" }, { 40, 10, 5, 5, 5 }, { "打怪经验加成+40%" } },
    ["8阶灵甲女"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8", "自定义属性11" }, { 40, 10, 5, 5, 5, 5 }, { "回收加成+5%" } },
    ["9阶灵甲女"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8", "自定义属性11" }, { 40, 10, 5, 5, 10, 5 }, { "10%概率触发鞭尸效果" } },
    ["10阶灵甲女"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比", "自定义属性8", "自定义属性11" }, { 40, 10, 5, 5, 10, 5 }, { "2%概率切割怪物2%" } },

    ["3阶灵甲限时"] = { { "自定义属性13", "生命百分比" }, { 20, 10 }, { "人物最大血量+10%" } },
    ["4阶灵甲限时"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比" }, { 20, 10, 5, 5 }, { "人物攻击加成+5%" } },
    ["5阶灵甲限时"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比" }, { 20, 10, 5, 5 }, { "1%概率对怪物造成1%切割伤害" } }, ---1%概率切割怪物1%(切割伤害直接到上海流程完成,不使用动态属性)
    ["5阶灵甲女限时"] = { { "自定义属性13", "生命百分比", "物防上限百分比", "物攻下限百分比" }, { 20, 10, 5, 5 }, { "1%概率对怪物造成1%切割伤害" } }, ---1%概率切割怪物1%(切割伤害直接到上海流程完成,不使用动态属性)

}
local tablesB = {
    --KeyName  触发概率 麻痹
    ["上古神兵1"] = { 20 },
    ["上古神兵2"] = { 23 },
    ["上古神兵3"] = { 26 },
    ["上古神兵4"] = { 29 },
    ["上古神兵5"] = { 34 },
    ["上古神兵6"] = { 39 },
    ["上古神兵7"] = { 44 },
    ["上古神兵8"] = { 50 },
    ["上古神兵9"] = { 55 },
    ["上古神兵10"] = { 60 },
}
print(tablesB["上古神兵10"][1] .. "啊啊啊")
--tablesB[item_KeyName][1]
local item_KeyName = ""
local item = ""
---------时装属性-------------
--if ShiZhuangList[item_KeyName] ~= "" or ShiZhuangList[item_KeyName] ~= nil then
--    local tab = ShiZhuangList[item_KeyName]
--    for i = 1, #tab[1] do
--        lualib:SetInt(item, tab[1][i], tab[2][i])
--    end
--
--    lualib:SetStr(item, "当前时装特有属性", tab[3][1])
--
--    lualib:DelayCall(item, 1, "玩家动态属性设置:SetItemDynamicAttr", "" .. item)
--
--end
local tab = ShiZhuangList["9阶灵甲"]
print(#tab[2])

local hurt = {
    --品阶 = {概率,百分比伤害)}
    [5] = { 1, 1 },
    [10] = { 2, 2 },
}
local s = {}
print(tostring(#s))

